{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of36.bin", "group1-shard2of36.bin", "group1-shard3of36.bin", "group1-shard4of36.bin", "group1-shard5of36.bin", "group1-shard6of36.bin", "group1-shard7of36.bin", "group1-shard8of36.bin", "group1-shard9of36.bin", "group1-shard10of36.bin", "group1-shard11of36.bin", "group1-shard12of36.bin", "group1-shard13of36.bin", "group1-shard14of36.bin", "group1-shard15of36.bin", "group1-shard16of36.bin", "group1-shard17of36.bin", "group1-shard18of36.bin", "group1-shard19of36.bin", "group1-shard20of36.bin", "group1-shard21of36.bin", "group1-shard22of36.bin", "group1-shard23of36.bin", "group1-shard24of36.bin", "group1-shard25of36.bin", "group1-shard26of36.bin", "group1-shard27of36.bin", "group1-shard28of36.bin", "group1-shard29of36.bin", "group1-shard30of36.bin", "group1-shard31of36.bin", "group1-shard32of36.bin", "group1-shard33of36.bin", "group1-shard34of36.bin", "group1-shard35of36.bin", "group1-shard36of36.bin"], "weights": [{"name": "backbone.stem.0.conv/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "backbone.stem.0.bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "backbone.stem.0.bn/beta", "shape": [32], "dtype": "float32"}, {"name": "backbone.stem.0.bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "backbone.stem.0.bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "backbone.stem.1.conv/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "backbone.stem.1.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.1.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.1.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.1.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.2.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "backbone.stem.2.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.2.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.2.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.stem.2.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.0.conv/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "backbone.dark2.0.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark2.0.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark2.0.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark2.0.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark2.1.cv2.conv/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv2.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv2.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv2.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv2.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.0.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.0.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.0.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.0.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.0.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.1.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.1.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.1.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.1.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.1.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.2.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.2.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.2.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.2.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.2.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.3.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv1.conv/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.3.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.3.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.3.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv3.3.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv1.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv1.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv1.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv1.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "backbone.dark2.1.cv4.conv/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "backbone.dark2.1.cv4.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark2.1.cv4.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark2.1.cv4.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark2.1.cv4.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark3.0.cv2.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv3.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv1.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv3.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv3.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv3.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv3.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.0.cv1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv2.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.0.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.0.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.0.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.0.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.0.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.1.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.2.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.3.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv1.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.3.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.3.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.3.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv3.3.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "backbone.dark3.1.cv4.conv/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "backbone.dark3.1.cv4.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark3.1.cv4.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark3.1.cv4.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark3.1.cv4.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark4.0.cv2.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv3.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv1.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv3.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv3.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv3.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv3.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.0.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv2.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.0.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.0.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.0.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.0.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.0.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.1.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.2.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.3.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv1.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.3.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.3.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.3.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv3.3.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark4.1.cv4.conv/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "backbone.dark4.1.cv4.bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark4.1.cv4.bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark4.1.cv4.bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark4.1.cv4.bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark5.0.cv2.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv2.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv2.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv2.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv2.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv3.conv/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv1.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv3.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv3.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv3.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv3.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv1.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv1.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv1.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.0.cv1.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "backbone.dark5.1.cv2.conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.0.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.0.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.0.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.0.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.0.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.1.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.2.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.3.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv1.conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.3.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.3.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.3.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv3.3.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "backbone.dark5.1.cv4.conv/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "backbone.dark5.1.cv4.bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark5.1.cv4.bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark5.1.cv4.bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "backbone.dark5.1.cv4.bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "sppcspc.cv1.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "sppcspc.cv1.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv1.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv1.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv1.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv3.conv/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "sppcspc.cv3.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv3.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv3.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv3.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv4.conv/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "sppcspc.cv4.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv4.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv4.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv4.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv5.conv/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "sppcspc.cv5.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv5.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv5.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv5.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv6.conv/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "sppcspc.cv2.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "sppcspc.cv6.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv6.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv6.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv6.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv2.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv2.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv2.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv2.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv7.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "sppcspc.cv7.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv7.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv7.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sppcspc.cv7.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_for_P5.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv_for_feat2.conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv_for_P5.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_for_P5.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_for_P5.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_for_P5.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_for_feat2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_for_feat2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_for_feat2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_for_feat2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv2.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.0.conv/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.0.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.0.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.0.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.0.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.1.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.2.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.3.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv1.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.3.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.3.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.3.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv3.3.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv4.conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv4.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv4.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv4.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_upsample1.cv4.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_for_P4.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv_for_feat1.conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv_for_P4.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_for_P4.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_for_P4.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_for_P4.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_for_feat1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_for_feat1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_for_feat1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_for_feat1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv2.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.0.conv/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.0.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.0.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.0.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.0.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.1.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.1.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.1.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.1.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.1.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.2.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.2.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.2.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.2.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.2.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.3.conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv1.conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.3.bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.3.bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.3.bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv3.3.bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv4.conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv4.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv4.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv4.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_upsample2.cv4.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv2.conv/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "down_sample1.cv2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv3.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "down_sample1.cv1.conv/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "down_sample1.cv3.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv3.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv3.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv3.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "down_sample1.cv1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv2.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.0.conv/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.0.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.0.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.0.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.0.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.1.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.1.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.1.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.1.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.1.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.2.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.2.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.2.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.2.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.2.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.3.conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv1.conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.3.bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.3.bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.3.bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv3.3.bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv4.conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv4.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv4.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv4.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample1.cv4.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv2.conv/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "down_sample2.cv2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv3.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "down_sample2.cv1.conv/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "down_sample2.cv3.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv3.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv3.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv3.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "down_sample2.cv1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv2.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv2.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv2.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv2.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv2.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.0.conv/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.0.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.0.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.0.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.0.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.1.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.1.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.1.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.1.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.1.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.2.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.2.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.2.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.2.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.2.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.3.conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv1.conv/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.3.bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.3.bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.3.bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv3.3.bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv1.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv1.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv1.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv1.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv4.conv/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv4.bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv4.bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv4.bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_for_downsample2.cv4.bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_3.rbr_dense.0/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_1x1.0/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "rep_conv_2.rbr_dense.0/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_1x1.0/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "rep_conv_1.rbr_dense.0/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_1x1.0/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "rep_conv_3.rbr_dense.1/gamma", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_dense.1/beta", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_dense.1/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_dense.1/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_1x1.1/gamma", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_1x1.1/beta", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_1x1.1/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_3.rbr_1x1.1/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "rep_conv_2.rbr_dense.1/gamma", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_dense.1/beta", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_dense.1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_dense.1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_1x1.1/gamma", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_1x1.1/beta", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_1x1.1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_2.rbr_1x1.1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "rep_conv_1.rbr_dense.1/gamma", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_dense.1/beta", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_dense.1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_dense.1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_1x1.1/gamma", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_1x1.1/beta", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_1x1.1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "rep_conv_1.rbr_1x1.1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "yolo_head_P5/kernel", "shape": [1, 1, 1024, 51], "dtype": "float32"}, {"name": "yolo_head_P5/bias", "shape": [51], "dtype": "float32"}, {"name": "yolo_head_P4/kernel", "shape": [1, 1, 512, 51], "dtype": "float32"}, {"name": "yolo_head_P4/bias", "shape": [51], "dtype": "float32"}, {"name": "yolo_head_P3/kernel", "shape": [1, 1, 256, 51], "dtype": "float32"}, {"name": "yolo_head_P3/bias", "shape": [51], "dtype": "float32"}]}]}