{"format": "layers-model", "generatedBy": "keras v2.1.5", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "backbone.stem.0.conv", "class_name": "Conv2D", "config": {"name": "backbone.stem.0.conv", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "backbone.stem.0.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.stem.0.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.stem.0.conv", 0, 0, {}]]]}, {"name": "si_lu_1", "class_name": "SiLU", "config": {"name": "si_lu_1", "trainable": true}, "inbound_nodes": [[["backbone.stem.0.bn", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_1", 0, 0, {}]]]}, {"name": "backbone.stem.1.conv", "class_name": "Conv2D", "config": {"name": "backbone.stem.1.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "backbone.stem.1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.stem.1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.stem.1.conv", 0, 0, {}]]]}, {"name": "si_lu_2", "class_name": "SiLU", "config": {"name": "si_lu_2", "trainable": true}, "inbound_nodes": [[["backbone.stem.1.bn", 0, 0, {}]]]}, {"name": "backbone.stem.2.conv", "class_name": "Conv2D", "config": {"name": "backbone.stem.2.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_2", 0, 0, {}]]]}, {"name": "backbone.stem.2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.stem.2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.stem.2.conv", 0, 0, {}]]]}, {"name": "si_lu_3", "class_name": "SiLU", "config": {"name": "si_lu_3", "trainable": true}, "inbound_nodes": [[["backbone.stem.2.bn", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_3", 0, 0, {}]]]}, {"name": "backbone.dark2.0.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.0.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "backbone.dark2.0.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.0.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.0.conv", 0, 0, {}]]]}, {"name": "si_lu_4", "class_name": "SiLU", "config": {"name": "si_lu_4", "trainable": true}, "inbound_nodes": [[["backbone.dark2.0.bn", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv2.conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_4", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_6", "class_name": "SiLU", "config": {"name": "si_lu_6", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv2.bn", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.0.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv3.0.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_6", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.0.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv3.0.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv3.0.conv", 0, 0, {}]]]}, {"name": "si_lu_7", "class_name": "SiLU", "config": {"name": "si_lu_7", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv3.0.bn", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv3.1.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_7", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv3.1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv3.1.conv", 0, 0, {}]]]}, {"name": "si_lu_8", "class_name": "SiLU", "config": {"name": "si_lu_8", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv3.1.bn", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv3.2.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_8", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv3.2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv3.2.conv", 0, 0, {}]]]}, {"name": "si_lu_9", "class_name": "SiLU", "config": {"name": "si_lu_9", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv3.2.bn", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv3.3.conv", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_9", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv1.conv", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_4", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv3.3.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv3.3.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv3.3.conv", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv1.conv", 0, 0, {}]]]}, {"name": "si_lu_10", "class_name": "SiLU", "config": {"name": "si_lu_10", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv3.3.bn", 0, 0, {}]]]}, {"name": "si_lu_5", "class_name": "SiLU", "config": {"name": "si_lu_5", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv1.bn", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["si_lu_10", 0, 0, {}], ["si_lu_8", 0, 0, {}], ["si_lu_6", 0, 0, {}], ["si_lu_5", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv4.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark2.1.cv4.conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "backbone.dark2.1.cv4.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark2.1.cv4.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark2.1.cv4.conv", 0, 0, {}]]]}, {"name": "si_lu_11", "class_name": "SiLU", "config": {"name": "si_lu_11", "trainable": true}, "inbound_nodes": [[["backbone.dark2.1.cv4.bn", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.0.cv2.conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_11", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.0.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.0.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_13", "class_name": "SiLU", "config": {"name": "si_lu_13", "trainable": true}, "inbound_nodes": [[["backbone.dark3.0.cv2.bn", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_13", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_11", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.0.cv3.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.0.cv1.conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv3.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.0.cv3.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.0.cv3.conv", 0, 0, {}]]]}, {"name": "backbone.dark3.0.cv1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.0.cv1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.0.cv1.conv", 0, 0, {}]]]}, {"name": "si_lu_14", "class_name": "SiLU", "config": {"name": "si_lu_14", "trainable": true}, "inbound_nodes": [[["backbone.dark3.0.cv3.bn", 0, 0, {}]]]}, {"name": "si_lu_12", "class_name": "SiLU", "config": {"name": "si_lu_12", "trainable": true}, "inbound_nodes": [[["backbone.dark3.0.cv1.bn", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["si_lu_14", 0, 0, {}], ["si_lu_12", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv2.conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_16", "class_name": "SiLU", "config": {"name": "si_lu_16", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv2.bn", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.0.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv3.0.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_16", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.0.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv3.0.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv3.0.conv", 0, 0, {}]]]}, {"name": "si_lu_17", "class_name": "SiLU", "config": {"name": "si_lu_17", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv3.0.bn", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv3.1.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_17", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv3.1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv3.1.conv", 0, 0, {}]]]}, {"name": "si_lu_18", "class_name": "SiLU", "config": {"name": "si_lu_18", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv3.1.bn", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv3.2.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_18", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv3.2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv3.2.conv", 0, 0, {}]]]}, {"name": "si_lu_19", "class_name": "SiLU", "config": {"name": "si_lu_19", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv3.2.bn", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv3.3.conv", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_19", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv1.conv", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv3.3.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv3.3.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv3.3.conv", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv1.conv", 0, 0, {}]]]}, {"name": "si_lu_20", "class_name": "SiLU", "config": {"name": "si_lu_20", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv3.3.bn", 0, 0, {}]]]}, {"name": "si_lu_15", "class_name": "SiLU", "config": {"name": "si_lu_15", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv1.bn", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["si_lu_20", 0, 0, {}], ["si_lu_18", 0, 0, {}], ["si_lu_16", 0, 0, {}], ["si_lu_15", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv4.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark3.1.cv4.conv", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "backbone.dark3.1.cv4.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark3.1.cv4.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark3.1.cv4.conv", 0, 0, {}]]]}, {"name": "si_lu_21", "class_name": "SiLU", "config": {"name": "si_lu_21", "trainable": true}, "inbound_nodes": [[["backbone.dark3.1.cv4.bn", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.0.cv2.conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_21", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.0.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.0.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_23", "class_name": "SiLU", "config": {"name": "si_lu_23", "trainable": true}, "inbound_nodes": [[["backbone.dark4.0.cv2.bn", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_23", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_21", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.0.cv3.conv", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.0.cv1.conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv3.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.0.cv3.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.0.cv3.conv", 0, 0, {}]]]}, {"name": "backbone.dark4.0.cv1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.0.cv1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.0.cv1.conv", 0, 0, {}]]]}, {"name": "si_lu_24", "class_name": "SiLU", "config": {"name": "si_lu_24", "trainable": true}, "inbound_nodes": [[["backbone.dark4.0.cv3.bn", 0, 0, {}]]]}, {"name": "si_lu_22", "class_name": "SiLU", "config": {"name": "si_lu_22", "trainable": true}, "inbound_nodes": [[["backbone.dark4.0.cv1.bn", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["si_lu_24", 0, 0, {}], ["si_lu_22", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv2.conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_26", "class_name": "SiLU", "config": {"name": "si_lu_26", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv2.bn", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.0.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv3.0.conv", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_26", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.0.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv3.0.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv3.0.conv", 0, 0, {}]]]}, {"name": "si_lu_27", "class_name": "SiLU", "config": {"name": "si_lu_27", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv3.0.bn", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv3.1.conv", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_27", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv3.1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv3.1.conv", 0, 0, {}]]]}, {"name": "si_lu_28", "class_name": "SiLU", "config": {"name": "si_lu_28", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv3.1.bn", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv3.2.conv", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_28", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv3.2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv3.2.conv", 0, 0, {}]]]}, {"name": "si_lu_29", "class_name": "SiLU", "config": {"name": "si_lu_29", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv3.2.bn", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv3.3.conv", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_29", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv1.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv1.conv", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv3.3.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv3.3.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv3.3.conv", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv1.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv1.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv1.conv", 0, 0, {}]]]}, {"name": "si_lu_30", "class_name": "SiLU", "config": {"name": "si_lu_30", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv3.3.bn", 0, 0, {}]]]}, {"name": "si_lu_25", "class_name": "SiLU", "config": {"name": "si_lu_25", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv1.bn", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["si_lu_30", 0, 0, {}], ["si_lu_28", 0, 0, {}], ["si_lu_26", 0, 0, {}], ["si_lu_25", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv4.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark4.1.cv4.conv", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "backbone.dark4.1.cv4.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark4.1.cv4.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark4.1.cv4.conv", 0, 0, {}]]]}, {"name": "si_lu_31", "class_name": "SiLU", "config": {"name": "si_lu_31", "trainable": true}, "inbound_nodes": [[["backbone.dark4.1.cv4.bn", 0, 0, {}]]]}, {"name": "backbone.dark5.0.cv2.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark5.0.cv2.conv", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["si_lu_31", 0, 0, {}]]]}, {"name": "backbone.dark5.0.cv2.bn", "class_name": "BatchNormalization", "config": {"name": "backbone.dark5.0.cv2.bn", "trainable": true, "axis": -1, "momentum": 0.97, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["backbone.dark5.0.cv2.conv", 0, 0, {}]]]}, {"name": "si_lu_33", "class_name": "SiLU", "config": {"name": "si_lu_33", "trainable": true}, "inbound_nodes": [[["backbone.dark5.0.cv2.bn", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_33", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["si_lu_31", 0, 0, {}]]]}, {"name": "backbone.dark5.0.cv3.conv", "class_name": "Conv2D", "config": {"name": "backbone.dark5.0.cv3.conv", 